import random


def magic_ball():
    a = random.randint(0, 19)
    return print(s_1[a])


s_1 = ['Бесспорно', 'Предрешено', 'Никаких сомнений', 'Определённо да', 'Можешь быть уверен в этом',
       'Мне кажется - да', 'Вероятнее всего', 'Хорошие перспективы', '	Знаки говорят - да', 'Да',
       'Пока неясно, попробуй снова', 'Спроси позже', 'Лучше не рассказывать', 'Сейчас нельзя предсказать',
       'Сконцентрируйся и спроси опять', 'Даже не думай', 'Мой ответ - нет', 'По моим данным - нет',
       'Перспективы не очень хорошие', 'Весьма сомнительно']


if __name__ == '__main2__':
    input()
    magic_ball()
